package com.jusfoun.common.constant;

/**
 * 说明：常量定义. <br>
 *
 * @author yjw@jusfoun.com
 * @date 2017年9月7日 上午10:29:12
 */
public class Constants {

	// 文化事业建设费 BDA0610334-WHSY100
	// 凭证种类代码
	public static final String WHJSSYF_REPCODE = "WHSY100";

	/**
	 * 说明： 纳税人资格类型. <br>
	 *
	 * @author yjw@jusfoun.com
	 * @date 2017年9月7日 上午10:29:45
	 */
	public enum NsrzglxType {

		C_101("101", "外出经营活动证明纳税人", "Y", "Y"), //
		C_102("102", "资源税管理甲种证明纳税人", "Y", "Y"), //
		C_103("103", "资源税管理乙种证明纳税人", "Y", "Y"), //
		C_104("104", "车船税标志纳税人 ", "Y", "Y"), //
		C_105("105", "中国居民身份证明纳税", "Y", "Y"), //
		C_106("106", "外国居民身份证明纳税", "Y", "Y"), //
		C_107("107", "核发金银首饰购货（加工）证明纳税", "Y", "Y"), //
		C_201("201", "增值税一般纳税人", "Y", "Y"), //
		C_202("202", "辅导期增值税一般纳税", "Y", "Y"), //
		C_203("203", "简易办法征收一般纳税", "Y", "Y"), //
		C_204("204", "按适用税率征收增值税小规模纳税人", "Y", "Y"), //
		C_205("205", "按征收率征收增值税小规模纳税人", "Y", "Y"), //
		C_301("301", "固定资产投资方向调节税纳税人  ", "Y", "Y"), //
		C_302("302", "金银首饰消费税纳税", "Y", "Y"), //
		C_303("303", "货运发票自开票纳税", "Y", "Y"), //
		C_304("304", "货运发票代开票纳税", "Y", "Y"), //
		C_305("305", "货运发票代开票中介机构", "Y", "Y"), //
		C_401("401", "有进出口经营权的外贸公司 ", "Y", "Y"), //
		C_402("402", "委托代理出口的生产企业 ", "Y", "Y"), //
		C_403("403", "自营出口的生产企", "Y", "Y"), //
		C_404("404", "出口退（免）税企", "Y", "Y"), //
		C_501("501", "校办企业", "Y", "Y"), //
		C_502("502", "软件及集成电路生产企业", "Y", "Y"), //
		C_503("503", "森工企业 ", "Y", "Y"), //
		C_504("504", "高校高科企业", "Y", "Y"), //
		C_505("505", "资源综合利用企", "Y", "Y"), //
		C_506("506", "废旧物资回收企", "Y", "Y"), //
		C_507("507", "饲料产品企业", "Y", "Y"), //
		C_508("508", "环保企业", "Y", "Y"), //
		C_509("509", "内资企业采购国产设", "Y", "Y"), //
		C_510("510", "外资企业采购国产设", "Y", "Y"), //
		C_511("511", "技改内资企业 ", "Y", "Y"), //
		C_512("512", "技改外资企业", "Y", "Y"), //
		C_513("513", "宣传文化单位", "Y", "Y"), //
		C_514("514", "高新技术产业企业", "Y", "Y"), //
		C_515("515", "外商投资企业", "Y", "Y"), //
		C_516("516", "国有粮食购销企业", "Y", "Y"), //
		C_517("517", "盐业批发企业", "Y", "Y"), //
		C_518("518", "成品油批发零售企 ", "Y", "Y"), //
		C_519("519", "政府储备食用植物油企业", "Y", "Y"), //
		C_520("520", "新办服务型企业（吸纳下岗失业人员", "Y", "Y"), //
		C_521("521", "现有服务型企业（吸纳下岗失业人员", "Y", "Y"), //
		C_522("522", "新办商贸企业（吸纳下岗失业人员 ", "Y", "Y"), //
		C_523("523", "现有商贸企业（吸纳下岗失业人员 ", "Y", "Y"), //
		C_524("524", "一般商贸企业", "Y", "Y"), //
		C_525("525", "经济实体（安置富余人员", "Y", "Y"), //
		C_526("526", "下岗再就业个体纳税人", "Y", "Y"), //
		C_527("527", "高校毕业生就业个体纳税人", "Y", "Y"), //
		C_528("528", "福利企业", "Y", "Y"), //
		C_529("529", "盲人按摩机构", "Y", "Y"), //
		C_530("530", "工疗机构 ", "Y", "Y"), //
		C_531("531", "其他集中安置残疾人单位", "Y", "Y"), //
		C_532("532", "销售供出口货物企业", "Y", "Y"), //
		C_533("533", "非居民企业", "Y", "Y"), //
		C_534("534", "非营利组织", "Y", "Y"), //
		C_535("535", "创业投资企业", "Y", "Y"), //
		C_536("536", "中小企业信用担保机构", "Y", "Y"), //
		C_537("537", "房地产开发经营纳税人", "Y", "Y"), //
		C_538("538", "非房地产开发经营纳税人 ", "Y", "Y"), //
		C_539("539", "生产新型墙体材料产品企业", "Y", "Y"), //
		C_540("540", "企业所得税汇总纳税居民企业 ", "Y", "Y"), //
		C_541("541", "乡镇企业", "Y", "Y"), //
		C_542("542", "小型微利企业", "Y", "Y"), //
		C_543("543", "增值税汇总纳税企 ", "Y", "Y"), //
		C_544("544", "消费税汇总纳税企 ", "Y", "Y"), //
		C_545("545", "印花税汇总纳税企 ", "Y", "Y"), //
		C_546("546", "企业所得税汇总纳税非居民企业 ", "Y", "Y"), //
		C_547("547", "境外注册中资控股居民企业", "Y", "Y"), //
		C_548("548", "企业重组符合特殊性税务处理条件的纳税", "Y", "Y"), //
		C_549("549", "跨境重组符合特殊性税务处理条件的纳税", "Y", "Y"), //
		C_601("601", "A级信用纳税人", "Y", "Y"), //
		C_602("602", "B级信用纳税人", "Y", "Y"), //
		C_603("603", "C级信用纳税人", "Y", "Y"), //
		C_604("604", "D级信用纳税人", "Y", "Y"), //
		C_701("701", "使用防伪税控纳税人", "Y", "Y"), //
		C_702("702", "使用税控收款机纳税人 ", "Y", "Y"), //
		C_703("703", "使用税控加油加纳税人 ", "Y", "Y"), //
		C_901("901", "委托代征纳税人（受托方） ", "Y", "Y"), //
		C_902("902", "被委托代征纳税人（代征对象 ", "Y", "Y"), //
		C_903("903", "代售印花税票纳税人 ", "Y", "Y"), //
		C_904("904", "利息所得税扣缴义务人", "Y", "Y"), //
		C_999("999", "其他", "Y", "Y");//

		private final String dm;
		private final String mc;
		private final String xybz;
		private final String yxbz;

		private NsrzglxType(String dm, String mc, String xybz, String yxbz) {
			this.dm = dm;
			this.mc = mc;
			this.xybz = xybz;
			this.yxbz = yxbz;
		}

		public String getDm() {
			return dm;
		}

		public String getMc() {
			return mc;
		}

		public String getXybz() {
			return xybz;
		}

		public String getYxbz() {
			return yxbz;
		}
	}

}
